namespace Task3_12__star_
{
    internal class Program
        /*Дано целое число в диапазоне 100–999. 
         * Вывести строку-описание данного числа, например: 256 — «двести пятьдесят шесть», 814 — «восемьсот четырнадцать». 
         * Если пользователь введёт данные не соответствующие условию задачи - выдать сообщение об ошибке.*/
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
